Tekla Open API Reference for Tekla Structures 2025
Phase.PhaseComment Property
 The phase comment.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string PhaseComment { get; set; }
Public Property PhaseComment As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Phase Class
Tekla.Structures.Model Namespace